#### Terraform Plan 📖

<details><summary>Show Plan</summary><br>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws.aws_ecs_service.application_servers will be updated in-place
  ~ resource "aws_ecs_service" "application_servers" {
        id                                 = "arn:aws:ecs:us-west-2:170683628345:service/application-container-cluster/application-servers"
        name                               = "application-servers"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:170683628345:task-definition/rails-task:1" -> (known after apply)
        # (16 unchanged attributes hidden)

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-0a30b64b6fd94f480",
            ] -> (known after apply)
          ~ subnets          = [
              - "subnet-042b8c0a6cece9358",
              + "subnet-381a335d",
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.aws.aws_ecs_service.background_workers will be updated in-place
  ~ resource "aws_ecs_service" "background_workers" {
        id                                 = "arn:aws:ecs:us-west-2:170683628345:service/application-container-cluster/background-workers"
        name                               = "background-workers"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:170683628345:task-definition/rails-task:1" -> (known after apply)
        # (16 unchanged attributes hidden)

      ~ network_configuration {
          ~ subnets          = [
              - "subnet-042b8c0a6cece9358",
              + "subnet-381a335d",
            ]
            # (2 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.aws.aws_ecs_task_definition.application_servers will be created
  + resource "aws_ecs_task_definition" "application_servers" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + image        = "amazonlinux:2"
                  + name         = "rails"
                  + portMappings = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::170683628345:role/ecs-execution-role"
      + family                   = "rails-task"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = "arn:aws:iam::170683628345:role/ecs-task-role"
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "ARM64"
          + operating_system_family = "LINUX"
        }
    }

  # module.aws.aws_ecs_task_definition.background_workers will be created
  + resource "aws_ecs_task_definition" "background_workers" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command      = [
                      + "bin/jobs",
                      + "start",
                    ]
                  + image        = "amazonlinux:2"
                  + name         = "rails"
                  + portMappings = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::170683628345:role/ecs-execution-role"
      + family                   = "rails-task"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = "arn:aws:iam::170683628345:role/ecs-task-role"
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "ARM64"
          + operating_system_family = "LINUX"
        }
    }

  # module.aws.aws_ecs_task_definition.this will be destroyed
  # (because aws_ecs_task_definition.this is not in configuration)
  - resource "aws_ecs_task_definition" "this" {
      - arn                      = "arn:aws:ecs:us-west-2:170683628345:task-definition/rails-task:1" -> null
      - arn_without_revision     = "arn:aws:ecs:us-west-2:170683628345:task-definition/rails-task" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - environment    = []
                  - essential      = true
                  - image          = "amazonlinux:2"
                  - mountPoints    = []
                  - name           = "rails"
                  - portMappings   = [
                      - {
                          - containerPort = 80
                          - hostPort      = 80
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls = []
                  - volumesFrom    = []
                },
            ]
        ) -> null
      - cpu                      = "256" -> null
      - execution_role_arn       = "arn:aws:iam::170683628345:role/ecs-execution-role" -> null
      - family                   = "rails-task" -> null
      - id                       = "rails-task" -> null
      - memory                   = "512" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 1 -> null
      - skip_destroy             = false -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
      - task_role_arn            = "arn:aws:iam::170683628345:role/ecs-task-role" -> null
      - track_latest             = false -> null
        # (2 unchanged attributes hidden)

      - runtime_platform {
          - cpu_architecture        = "ARM64" -> null
          - operating_system_family = "LINUX" -> null
        }
    }

  # module.aws.aws_lb_target_group.this must be replaced
-/+ resource "aws_lb_target_group" "this" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-west-2:170683628345:targetgroup/rails-starter-target-group/0769cb0c4e8ba29d" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/rails-starter-target-group/0769cb0c4e8ba29d" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-west-2:170683628345:targetgroup/rails-starter-target-group/0769cb0c4e8ba29d" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "rails-starter-target-group"
      + name_prefix                        = (known after apply)
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
      ~ vpc_id                             = "vpc-07ab53e02e72da9cd" -> "vpc-4a39622f" # forces replacement
        # (7 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "200" -> (known after apply)
          ~ path                = "/" -> "/health"
            # (7 unchanged attributes hidden)
        }

      ~ stickiness (known after apply)
      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      ~ target_failover (known after apply)
      - target_failover {}

      ~ target_group_health (known after apply)
      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      ~ target_health_state (known after apply)
      - target_health_state {}
    }

  # module.aws.aws_security_group.this must be replaced
-/+ resource "aws_security_group" "this" {
      ~ arn                    = "arn:aws:ec2:us-west-2:170683628345:security-group/sg-0a30b64b6fd94f480" -> (known after apply)
      ~ id                     = "sg-0a30b64b6fd94f480" -> (known after apply)
        name                   = "rails-sg"
      + name_prefix            = (known after apply)
      ~ owner_id               = "170683628345" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ vpc_id                 = "vpc-07ab53e02e72da9cd" -> "vpc-4a39622f" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.aws.aws_subnet.us-west-2a will be destroyed
  # (because aws_subnet.us-west-2a is not in configuration)
  - resource "aws_subnet" "us-west-2a" {
      - arn                                            = "arn:aws:ec2:us-west-2:170683628345:subnet/subnet-042b8c0a6cece9358" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-2a" -> null
      - availability_zone_id                           = "usw2-az1" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-042b8c0a6cece9358" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "170683628345" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {} -> null
      - tags_all                                       = {} -> null
      - vpc_id                                         = "vpc-07ab53e02e72da9cd" -> null
        # (4 unchanged attributes hidden)
    }

  # module.aws.aws_vpc.this will be destroyed
  # (because aws_vpc.this is not in configuration)
  - resource "aws_vpc" "this" {
      - arn                                  = "arn:aws:ec2:us-west-2:170683628345:vpc/vpc-07ab53e02e72da9cd" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-0473bd56eda36c20a" -> null
      - default_route_table_id               = "rtb-05e642d606365a588" -> null
      - default_security_group_id            = "sg-07b48114d1e671fac" -> null
      - dhcp_options_id                      = "dopt-a7e722c2" -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-07ab53e02e72da9cd" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-05e642d606365a588" -> null
      - owner_id                             = "170683628345" -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null
        # (4 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 5 to destroy.

```

</details>